jcrvlh/kit/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash Size (16 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM Configuration (8 MB Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Cartão microSD (FAT) — nomes de arquivo longos e acentuados para os pacotes
# .kit e assets. LFN na heap (usa PSRAM) para não estourar a stack.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# ELF Loader — carregamento dinâmico de Tools (.so) a partir do cartão microSD.
# O objeto compartilhado é ligado contra a tabela de símbolos do KIT
# (kit_tool_loader). Base do dlopen() = /sdcard.
#
# LOAD_PSRAM fica DESLIGADO: no elf_loader 1.3.3 o caminho de shared object
# (esp_elf_load_segment) não faz o remap DROM->IROM do S3, então código em
# PSRAM cai em InstructionFetchError. A Tool é relocada na RAM interna (IRAM),
# executável nos dois barramentos. Tools pequenas (Marco 1); rever quando
# precisarem de mais que ~100 KB.
CONFIG_ELF_LOADER=y
CONFIG_ELF_LOADER_LOAD_PSRAM=n
CONFIG_ELF_DYNAMIC_LOAD_SHARED_OBJECT=y
CONFIG_ELF_FILE_SYSTEM_BASE_PATH="/sdcard"

# --- USB: "Modo pen drive" (Mass Storage) ---------------------------------
# O TinyUSB só é instalado quando o usuário entra em Ajustes > Modo pen drive
# (kit_usb_msc). No uso normal a porta USB segue como USB-Serial/JTAG
# (console + Web Installer) — o ESP32-S3 tem um PHY USB só, compartilhado.
# Ao sair do modo, o KIT reinicia para devolver o barramento ao console.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=8192

# MALLOC_CAP_EXEC só existe fora da DIRAM comum quando o memory protection
# (PMP W^X) da IDF está ligado — nesse caso não sobra heap executável e o
# esp_elf_malloc(exec=true) do loader falha com ENOMEM. Desligado, a DIRAM
# principal (232 KB) vira executável e a Tool aloca dali sem remap nenhum.
# CONFIG_ESP_SYSTEM_MEMPROT_FEATURE is not set

# Custom Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Bootloader & OTA Rollback Support
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- Conectividade Wi-Fi (kit_network) -----------------------------------
# STA offline-first: a pilha (esp_wifi/lwip) só sobe quando o usuário liga o
# Wi-Fi. Com CONFIG_PM_ENABLE o driver exige modem-sleep (WIFI_PS_MIN_MODEM,
# em runtime). Buffers enxutos e IRAM-opt desligado — o KIT faz HTTPS pontual
# (catálogo, OTA), não streaming — e a IRAM/RAM interna é disputada com o DMA
# do display AMOLED (QSPI). Ver kit_network / ADR de conectividade.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
# O padrão do IDF (16) estoura a checagem do wifi_init.c com os buffers
# enxutos acima (RX_BA_WIN <= DYNAMIC_RX_BUFFER_NUM e <= 2x STATIC). Sem esta
# linha o build local passa (sdkconfig já tem 6) mas o CI, que parte só do
# defaults, quebra.
CONFIG_ESP_WIFI_RX_BA_WIN=6

# Buffers do Wi-Fi/LWIP na PSRAM. A pilha esp_wifi picotava a RAM interna
# EXECUTÁVEL (~7 KB de maior bloco livre depois de um HTTPS do catálogo) e o
# .text de uma Tool .so (~10 KB, relocado na RAM interna) não cabia mais — a
# Tool "não abria até reiniciar". Com os buffers na PSRAM a RAM interna exec
# fica livre para as Tools. O KIT só faz HTTPS pontual (catálogo/OTA/NTP), não
# streaming, então o custo de latência é irrelevante. Rede de segurança:
# kit_tool_manager derruba a pilha (esp_wifi_deinit) e tenta de novo se ainda
# assim faltar RAM.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Catálogo por HTTPS: o esp_http_client + TLS adicionam ~165 KB de flash. O
# bundle de CAs "comum" (~40 raizões) cobre GitHub Pages (Let's Encrypt / ISRG)
# e as Releases (DigiCert) e poupa flash vs. o FULL.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# TLS na PSRAM. A sessão mbedtls precisa de ~20-36 KB (IN_CONTENT_LEN 16 KB +
# OUT + handshake) e a RAM interna não tem bloco contíguo desse tamanho com o
# Wi-Fi no ar — mbedtls_ssl_setup falhava com -0x7F00 (ALLOC_FAILED) e o
# catálogo nunca carregava. mbedtls não faz DMA; o acelerador de AES/SHA da
# IDF trata buffer em PSRAM. Sobra IRAM para relocar o .so das Tools.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# FreeRTOS CPU Clock (240MHz) & Stack
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Gerenciamento de energia — "meia-hibernação" com a tela em repouso.
# DFS (240<->40 MHz) fica sempre ativo; o light sleep automático é ligado em
# runtime só quando a tela apaga E não há USB (ver kit_power_set_screen_sleeping).
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_PM_SLP_IRAM_OPT=y
CONFIG_PM_RTOS_IDLE_OPT=y
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y

# Native USB Serial / JTAG Console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y



# LVGL Optimizations (Disable unused examples & demos)
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_DRAW_SW_RGB565_SWAP=y
CONFIG_LV_COLOR_16_SWAP=y

# Memória do LVGL: o pool builtin de 64 KB estourava em telas pesadas — fontes
# de 44/72 px + máscaras de canto arredondado + scrollbar (ex.: Sobre) e no
# slider de brilho (máscara de círculo redesenhada a cada arrasto). lv_malloc
# devolvia NULL → LV_ASSERT_MALLOC → LV_ASSERT_HANDLER (while(1)) → trava dura no
# task watchdog. Passando pro malloc da libc, o LVGL aloca do heap do ESP-IDF
# (interno + PSRAM), que tem MB de folga. E o handler aborta (reboot
# recuperável) em vez de travar caso ainda falte memória.
CONFIG_LV_USE_BUILTIN_MALLOC=n
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_ASSERT_HANDLER_INCLUDE="esp_system.h"
CONFIG_LV_ASSERT_HANDLER="esp_system_abort(\"LVGL assert\");"

# QR Code — a Tool Globo de Bingo mostra um QR pro gerador de cartelas
# (web-installer/bingo.html no GitHub Pages). Usa lv_canvas, já habilitado.
CONFIG_LV_USE_QRCODE=y


# LVGL Fonts — a UI usa só as fontes próprias do KIT (kit_fonts.h). Do conjunto
# Montserrat embutido no LVGL ficamos apenas com o tamanho 14, que é o
# LV_FONT_DEFAULT (usado internamente pelo LVGL e por qualquer label sem fonte
# explícita). Os demais tamanhos foram removidos para economizar flash.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# Portal cativo do Wi-Fi (kit_net_portal): o buffer default de 512 B para
# cabeçalhos/URI do esp_http_server é suficiente para o iPhone, mas o Chrome
# do Android manda mais headers na sondagem de captive portal
# (generate_204/gen_204: Accept, Accept-Language, X-Requested-With,
# User-Agent, etc.) e estoura o limite — o servidor responde com
# "essp_http_server: httpd_parse.c: ... header fields are too long". 1024 B
# cobre a sondagem do Android com folga.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=1024


